docs(README): convirtiendo diagrama de arquitectura ascii a mermaid interactivo
